[
    {
        "startDate": "2020-05-18",
        "endDate": "",
        "role": "Senior Software Engineer",
        "org": "Atlassian",
        "orgLogo": {
            "url": "/assets/atlassian.png",
            "width": "120",
            "height": "20"
        },
        "location": "India(Remote)",
        "keyPoints": [
            "Senior Backend Engineer in Jira Software Roadmaps(Timeline) team(it's a great team based out in Sydney office)",
            "Handled various crucial features from start to finish.",
            "Implemented design patterns to simplify error handling throughout the system.",
            "Aided in enhancing the development cycle of Jira Monolith by setting up a remote development environment as a proof of concept (POC).",
            "Successfully launched Jira Timeline from Beta to General Availability (GA) for Company Managed Projects.",
            "Ran experimentation to strategically enable Timeline by default for users, and findings indicated favorable user response 👍"
        ],
        "techs": [
            "SpringBoot",
            "Kotlin",
            "Java",
            "AWS",
            "Problem Solving",
            "Design Patterns",
            "Test Driven Development",
            "Domain Driven Development"
        ]
    },
    {
        "startDate": "2019-07-31",
        "endDate": "2020-05-15",
        "role": "Senior Member of Technical Staff",
        "org": "VMware",
        "orgLogo": {
            "url": "/assets/vmware.png",
            "width": "120",
            "height": "30"
        },
        "location": "Bengaluru, India",
        "keyPoints": [
            "Contributed to the design, development and maintenance of critical services ensuring the reliability of VMware Cloud on AWS.",
            "Developed services that could grow and change as needed.",
            "Helped new engineers and interns learn and grow.",
            "Led the Scrum team to work effectively.",
            "Kept improving existing setups to make them work better."
        ],
        "techs": [
            "StackStorm",
            "Python3",
            "Angular",
            "Java",
            "SpringBoot",
            "VMware Clarity",
            "Serverless",
            "Docker",
            "Kubernetes",
            "Jenkins",
            "AWS",
            "VMC on AWS",
            "Problem Solving",
            "Scrum Master",
            "Design Patterns"
        ]
    },
    {
        "startDate": "2016-12-19",
        "endDate": "2019-07-31",
        "role": "Member of Technical Staff - 3",
        "org": "VMware",
        "orgLogo": {
            "url": "/assets/vmware.png",
            "width": "120",
            "height": "30"
        },
        "location": "Bengaluru, India",
        "keyPoints": [
            "Engineered and maintained a diverse range of services vital for ensuring the reliability and performance of VMware Cloud on AWS.",
            "Led discussions, designs, and development efforts for novel features and microservices, emphasizing scalability and extensibility.",
            "Applied industry-standard Design Patterns to optimize the architecture and efficiency of solutions.",
            "Actively engaged in internal innovation events such as Borathons (Hackathons) and RADIO (internal platform for research work sharing) to foster creativity and knowledge-sharing.",
            "Experimentation with new Docker images to enhance system functionality and flexibility.",
            "Continuously optimized and refined existing implementations to elevate performance and user experience."
        ],
        "techs": [
            "Python3",
            "Angular",
            "Java",
            "SpringBoot",
            "VMware Clarity",
            "Serverless",
            "Docker",
            "Kubernetes",
            "Jenkins",
            "AWS",
            "VMC on AWS",
            "Problem Solving",
            "Scrum Master",
            "Design Patterns"
        ],
        "achievements": [
            {
                "description": "Presented a talk in SRECon 19 Asia Pacific - Enhance Your Python Code Beyond GIL",
                "links": [
                    "https://www.usenix.org/conference/srecon19asia/presentation/bhojwani"
                ]
            },
            {
                "description": "Certificate of Oustanding Recognition (Business Unit level award given quarterly to one project)"
            },
            {
                "description": "Certificate of Participation in Borathon - K8s based solution to share private resources"
            },
            {
                "description": "2nd Rank in CPBU Hackathon - Implement serverless computing and showcase Functions-as-a-service at scale"
            },
            {
                "description": "Optimised number of api calls and payload exchanged between client and server by factor of 32 by batching tasks status fetch from UI and dependent tasks in backend. This also improved user experience"
            }
        ]
    },
    {
        "startDate": "2015-10-18",
        "endDate": "2016-12-16",
        "role": "Senior Software Engineer",
        "org": "GoPigeon (now Narvar)",
        "orgLogo": {
            "url": "/assets/gopigeon.png",
            "width": "120",
            "height": "40"
        },
        "location": "Bengaluru, India",
        "keyPoints": [
            "Directed the design and development of a flagship Business-to-Business (B2B) product tailored for E-commerce and Surface Shipments, leveraging Django, AngularJS, and MySQL technologies on AWS.",
            "Implemented RabbitMQ for efficient queuing and Celery as a robust task manager to facilitate seamless asynchronous operations.",
            "Engineered a comprehensive DevOps dashboard enabling real-time monitoring and streamlined actions such as upgrades and deployments across diverse server environments, including App Servers, Queuing Servers, and Consumers.",
            "Introduced and configured rate-limiting and throttling mechanisms for exposed REST APIs utilizing Django-Ratelimit, bolstering system security and stability.",
            "Strategically optimized cloud resource costs by meticulously selecting appropriate EC2 instances, ensuring optimal performance while maximizing cost-efficiency."
        ],
        "techs": [
            "Python2.7",
            "Python3",
            "Django",
            "MySQL",
            "AWS",
            "EC2",
            "AWS RDS",
            "S3",
            "NewRelic"
        ],
        "achievements": [
            {
                "description": "Contributed an improvement in Django-Ratelimit(Open Source)",
                "links": [
                    "https://github.com/jsocol/django-ratelimit/pull/100"
                ]
            }
        ]
    },
    {
        "startDate": "2014-10-17",
        "endDate": "2015-10-15",
        "role": "Software Engineer",
        "org": "Practo",
        "orgLogo": {
            "url": "/assets/practo.svg",
            "width": "80",
            "height": "40"
        },
        "location": "Bengaluru, India",
        "keyPoints": [
            "Primarily focused on backend engineering while also contributing to frontend development tasks.",
            "Led the implementation of complex features such as Merge Profiles, which entailed substantial data manipulation and meticulous maintenance of data integrity.",
            "Architected and developed a Micro-Service named Audits-as-a-Service, dedicated to efficiently storing data changes and associated metadata."
        ],
        "techs": [
            "Symfony2",
            "PHP",
            "MySQL",
            "Python"
        ],
        "achievements": [
            {
                "description": "Was offered position of Team Lead",
                "links": []
            }
        ]
    },
    {
        "startDate": "2014-07-07",
        "endDate": "2014-10-14",
        "role": "Software Development Engineer - 1",
        "org": "Commonfloor",
        "orgLogo": {
            "url": "/assets/commonfloor.png",
            "width": "42",
            "height": "20"
        },
        "location": "Bengaluru, India",
        "keyPoints": [
            "Primarily contributed in backend development using the PHP Zend Framework.",
            "Proficiently resolved bugs and implemented new features to enhance platform functionality and user experience."
        ],
        "techs": [
            "PHP",
            "Zend",
            "MySQL"
        ],
        "achievements": [
            {
                "description": "Spot Award for Quickly Resolving Production Bugs",
                "links": []
            }
        ]
    }
]